In [1]:
import pandas as pd

In [2]:
# making data frame

In [3]:
info={'name':["aayan",'aayan1',"aayan",'aayan1'],
'age':[22,None,23,None],
     'gpa':[6,None,5,None]}
df=pd.DataFrame(info)
print(df)
print(df.index)
print(df.columns)

     name   age  gpa
0   aayan  22.0  6.0
1  aayan1   NaN  NaN
2   aayan  23.0  5.0
3  aayan1   NaN  NaN
RangeIndex(start=0, stop=4, step=1)
Index(['name', 'age', 'gpa'], dtype='object')

In [4]:
listdf=pd.DataFrame([['aayan',33],['aayan2',35],['aayan3',34]],columns=['name','age'])
print(listdf)

     name  age
0   aayan   33
1  aayan2   35
2  aayan3   34

In [5]:
#importing data

In [6]:
df=pd.read_csv('employee.csv')
print(df,type(df))

   employee_id           name  age   department  salary
0          101       John Doe   29  Engineering   75000
1          102      Sarah Lee   32    Marketing   68000
2          103     Ravi Kumar   26      Finance   59000
3          104    Emily Clark   35           HR   72000
4          105  Michael Smith   41  Engineering   88000 <class 'pandas.core.frame.DataFrame'>

In [7]:
df1=pd.read_json('employee.json')
print(df,type(df))

   employee_id           name  age   department  salary
0          101       John Doe   29  Engineering   75000
1          102      Sarah Lee   32    Marketing   68000
2          103     Ravi Kumar   26      Finance   59000
3          104    Emily Clark   35           HR   72000
4          105  Michael Smith   41  Engineering   88000 <class 'pandas.core.frame.DataFrame'>

In [8]:
#EDA

In [9]:
print(df.head(3))

   employee_id        name  age   department  salary
0          101    John Doe   29  Engineering   75000
1          102   Sarah Lee   32    Marketing   68000
2          103  Ravi Kumar   26      Finance   59000

In [10]:
print(df.tail(3))

   employee_id           name  age   department  salary
2          103     Ravi Kumar   26      Finance   59000
3          104    Emily Clark   35           HR   72000
4          105  Michael Smith   41  Engineering   88000

In [11]:
print(df.sample(2))

   employee_id       name  age   department  salary
1          102  Sarah Lee   32    Marketing   68000
0          101   John Doe   29  Engineering   75000

In [12]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   employee_id  5 non-null      int64
 1   name         5 non-null      object
 2   age          5 non-null      int64
 3   department   5 non-null      object
 4   salary       5 non-null      int64
dtypes: int64(3), object(2)
memory usage: 332.0+ bytes
None

In [13]:
print(df.shape)

(5, 5)

In [14]:
print(df.describe())

       employee_id        age        salary
count     5.000000   5.000000      5.000000
mean    103.000000  32.600000  72400.000000
std       1.581139   5.770615  10597.169433
min     101.000000  26.000000  59000.000000
25%     102.000000  29.000000  68000.000000
50%     103.000000  32.000000  72000.000000
75%     104.000000  35.000000  75000.000000
max     105.000000  41.000000  88000.000000

In [15]:
print(df.columns)

Index(['employee_id', 'name', 'age', 'department', 'salary'], dtype='object')

In [16]:
print(df.nunique())

employee_id    5
name           5
age            5
department     4
salary         5
dtype: int64

In [17]:
#accessing data

In [18]:
print(df.loc[0:2])

   employee_id        name  age   department  salary
0          101    John Doe   29  Engineering   75000
1          102   Sarah Lee   32    Marketing   68000
2          103  Ravi Kumar   26      Finance   59000

In [19]:
print(df.iloc[0:2,0])

0    101
1    102
Name: employee_id, dtype: int64

In [20]:
print(df.loc[0,'name'])

John Doe

In [21]:
print(df.iloc[0:2,0:2])

   employee_id       name
0          101   John Doe
1          102  Sarah Lee

In [22]:
print(df.at[0,'name'])

John Doe

In [23]:
print(df.iat[0,1])

John Doe

In [24]:
#filtering data

In [25]:
df=df[(df['age']>30)]
df

   employee_id           name  age   department  salary
1          102      Sarah Lee   32    Marketing   68000
3          104    Emily Clark   35           HR   72000
4          105  Michael Smith   41  Engineering   88000

In [26]:
df=df[(df['age']>30) & (df['salary']>70000)]
df

   employee_id           name  age   department  salary
3          104    Emily Clark   35           HR   72000
4          105  Michael Smith   41  Engineering   88000

In [27]:
df=df.query('age > 40')
df

   employee_id           name  age   department  salary
4          105  Michael Smith   41  Engineering   88000

In [28]:
#data cleaning

In [29]:
df=pd.read_csv('employee.csv')
df

   employee_id           name  age   department  salary
0          101       John Doe   29  Engineering   75000
1          102      Sarah Lee   32    Marketing   68000
2          103     Ravi Kumar   26      Finance   59000
3          104    Emily Clark   35           HR   72000
4          105  Michael Smith   41  Engineering   88000

In [30]:
print(df.isna())

   employee_id   name    age  department  salary
0        False  False  False       False   False
1        False  False  False       False   False
2        False  False  False       False   False
3        False  False  False       False   False
4        False  False  False       False   False

In [31]:
df=pd.DataFrame(info)
df

     name   age  gpa
0   aayan  22.0  6.0
1  aayan1   NaN  NaN
2   aayan  23.0  5.0
3  aayan1   NaN  NaN

In [32]:
print(df.dropna())

    name   age  gpa
0  aayan  22.0  6.0
2  aayan  23.0  5.0

In [33]:
print(df.dropna(axis=1))

     name
0   aayan
1  aayan1
2   aayan
3  aayan1

In [34]:
print(df.fillna(1))

     name   age  gpa
0   aayan  22.0  6.0
1  aayan1   1.0  1.0
2   aayan  23.0  5.0
3  aayan1   1.0  1.0

In [35]:
print(df['age'].fillna(1))

0    22.0
1     1.0
2    23.0
3     1.0
Name: age, dtype: float64

In [36]:
print(df.ffill())

     name   age  gpa
0   aayan  22.0  6.0
1  aayan1  22.0  6.0
2   aayan  23.0  5.0
3  aayan1  23.0  5.0

In [37]:
print(df.bfill())

     name   age  gpa
0   aayan  22.0  6.0
1  aayan1  23.0  5.0
2   aayan  23.0  5.0
3  aayan1   NaN  NaN

In [38]:
print(df['age'].duplicated())

0    False
1    False
2    False
3     True
Name: age, dtype: bool

In [39]:
print(df.drop_duplicates(subset=['name','age']))

     name   age  gpa
0   aayan  22.0  6.0
1  aayan1   NaN  NaN
2   aayan  23.0  5.0

In [40]:
#cleaning data

In [41]:
df['age']=df['age'].fillna(df['age'].mean())
df['gpa']=df['gpa'].fillna(df['gpa'].mean())
print(df['age'].astype('int64'))

0    22
1    22
2    23
3    22
Name: age, dtype: int64

In [42]:
df

     name   age  gpa
0   aayan  22.0  6.0
1  aayan1  22.5  5.5
2   aayan  23.0  5.0
3  aayan1  22.5  5.5

In [43]:
print(df['name'].str.capitalize())

print(df['name'].str.upper())

print(df['name'].str.lower())

print(df['name'].str.len())

print(df['name'].str.startswith('M'))

0     Aayan
1    Aayan1
2     Aayan
3    Aayan1
Name: name, dtype: object
0     AAYAN
1    AAYAN1
2     AAYAN
3    AAYAN1
Name: name, dtype: object
0     aayan
1    aayan1
2     aayan
3    aayan1
Name: name, dtype: object
0    5
1    6
2    5
3    6
Name: name, dtype: int64
0    False
1    False
2    False
3    False
Name: name, dtype: bool

In [44]:
#transforming data

In [45]:
df['half age']=df['age'].apply(lambda x : x/2)
df

     name   age  gpa  half age
0   aayan  22.0  6.0     11.00
1  aayan1  22.5  5.5     11.25
2   aayan  23.0  5.0     11.50
3  aayan1  22.5  5.5     11.25

In [46]:
gpa_map={6.0:6,5.0:5,5.5:5}
df['gpa']=df['gpa'].map(gpa_map)
df

     name   age  gpa  half age
0   aayan  22.0    6     11.00
1  aayan1  22.5    5     11.25
2   aayan  23.0    5     11.50
3  aayan1  22.5    5     11.25

In [47]:
df

     name   age  gpa  half age
0   aayan  22.0    6     11.00
1  aayan1  22.5    5     11.25
2   aayan  23.0    5     11.50
3  aayan1  22.5    5     11.25

In [48]:
#renaming columns

In [49]:
df.columns=['age','gpa','half age','income']
df

      age   gpa  half age  income
0   aayan  22.0         6   11.00
1  aayan1  22.5         5   11.25
2   aayan  23.0         5   11.50
3  aayan1  22.5         5   11.25

In [51]:
df.columns=['name','age','gpa','half age']
df

     name   age  gpa  half age
0   aayan  22.0    6     11.00
1  aayan1  22.5    5     11.25
2   aayan  23.0    5     11.50
3  aayan1  22.5    5     11.25

In [ ]:
#sorting

In [53]:
df=df.sort_values('age')
df

     name   age  gpa  half age
0   aayan  22.0    6     11.00
1  aayan1  22.5    5     11.25
3  aayan1  22.5    5     11.25
2   aayan  23.0    5     11.50

In [54]:
df['old rank']=df['age'].rank(ascending=False)
df

     name   age  gpa  half age  old rank
0   aayan  22.0    6     11.00       4.0
1  aayan1  22.5    5     11.25       2.5
3  aayan1  22.5    5     11.25       2.5
2   aayan  23.0    5     11.50       1.0

In [56]:
df=df.groupby('age').agg({'gpa':'max','age':'max'})
df

      gpa   age
age
22.0    6  22.0
22.5    5  22.5
23.0    5  23.0

In [58]:
df=pd.read_csv('employee.csv')
df

   employee_id           name  age   department  salary
0          101       John Doe   29  Engineering   75000
1          102      Sarah Lee   32    Marketing   68000
2          103     Ravi Kumar   26      Finance   59000
3          104    Emily Clark   35           HR   72000
4          105  Michael Smith   41  Engineering   88000

In [ ]:
#reshaping data

In [59]:
melttable=df.melt(id_vars=['employee_id','name'],
                 value_vars=['age','salary'],
                 var_name='metrics',
                 value_name='value')
melttable

   employee_id           name metrics  value
0          101       John Doe     age     29
1          102      Sarah Lee     age     32
2          103     Ravi Kumar     age     26
3          104    Emily Clark     age     35
4          105  Michael Smith     age     41
5          101       John Doe  salary  75000
6          102      Sarah Lee  salary  68000
7          103     Ravi Kumar  salary  59000
8          104    Emily Clark  salary  72000
9          105  Michael Smith  salary  88000

In [63]:
pivottable=melttable.pivot(index=['employee_id','name'],
                   columns=['metrics'],
                   values='value')
pivottable

metrics                    age  salary
employee_id name
101         John Doe        29   75000
102         Sarah Lee       32   68000
103         Ravi Kumar      26   59000
104         Emily Clark     35   72000
105         Michael Smith   41   88000

In [ ]:
#pandas merging

In [64]:
inn=pd.merge(df,df,on='employee_id',how='inner')
inn

,employee_id,name_x,age_x,department_x,salary_x,name_y,age_y,department_y,salary_y
0,101,John Doe,29,Engineering,75000,John Doe,29,Engineering,75000
1,102,Sarah Lee,32,Marketing,68000,Sarah Lee,32,Marketing,68000
2,103,Ravi Kumar,26,Finance,59000,Ravi Kumar,26,Finance,59000
3,104,Emily Clark,35,HR,72000,Emily Clark,35,HR,72000
4,105,Michael Smith,41,Engineering,88000,Michael Smith,41,Engineering,88000

In [66]:
out=pd.merge(df,df,on='employee_id',how='outer')
out

,employee_id,name_x,age_x,department_x,salary_x,name_y,age_y,department_y,salary_y
0,101,John Doe,29,Engineering,75000,John Doe,29,Engineering,75000
1,102,Sarah Lee,32,Marketing,68000,Sarah Lee,32,Marketing,68000
2,103,Ravi Kumar,26,Finance,59000,Ravi Kumar,26,Finance,59000
3,104,Emily Clark,35,HR,72000,Emily Clark,35,HR,72000
4,105,Michael Smith,41,Engineering,88000,Michael Smith,41,Engineering,88000

In [67]:
left=pd.merge(df,df,on='employee_id',how='left')
left

,employee_id,name_x,age_x,department_x,salary_x,name_y,age_y,department_y,salary_y
0,101,John Doe,29,Engineering,75000,John Doe,29,Engineering,75000
1,102,Sarah Lee,32,Marketing,68000,Sarah Lee,32,Marketing,68000
2,103,Ravi Kumar,26,Finance,59000,Ravi Kumar,26,Finance,59000
3,104,Emily Clark,35,HR,72000,Emily Clark,35,HR,72000
4,105,Michael Smith,41,Engineering,88000,Michael Smith,41,Engineering,88000

In [68]:
right=pd.merge(df,df,on='employee_id',how='right')
right

,employee_id,name_x,age_x,department_x,salary_x,name_y,age_y,department_y,salary_y
0,101,John Doe,29,Engineering,75000,John Doe,29,Engineering,75000
1,102,Sarah Lee,32,Marketing,68000,Sarah Lee,32,Marketing,68000
2,103,Ravi Kumar,26,Finance,59000,Ravi Kumar,26,Finance,59000
3,104,Emily Clark,35,HR,72000,Emily Clark,35,HR,72000
4,105,Michael Smith,41,Engineering,88000,Michael Smith,41,Engineering,88000

In [ ]:
#data concatination

In [70]:
pd.concat([df,df])

   employee_id           name  age   department  salary
0          101       John Doe   29  Engineering   75000
1          102      Sarah Lee   32    Marketing   68000
2          103     Ravi Kumar   26      Finance   59000
3          104    Emily Clark   35           HR   72000
4          105  Michael Smith   41  Engineering   88000
0          101       John Doe   29  Engineering   75000
1          102      Sarah Lee   32    Marketing   68000
2          103     Ravi Kumar   26      Finance   59000
3          104    Emily Clark   35           HR   72000
4          105  Michael Smith   41  Engineering   88000

In [71]:
pd.concat([df,df],axis=1)

,employee_id,name,age,department,salary,employee_id,name,age,department,salary
0,101,John Doe,29,Engineering,75000,101,John Doe,29,Engineering,75000
1,102,Sarah Lee,32,Marketing,68000,102,Sarah Lee,32,Marketing,68000
2,103,Ravi Kumar,26,Finance,59000,103,Ravi Kumar,26,Finance,59000
3,104,Emily Clark,35,HR,72000,104,Emily Clark,35,HR,72000
4,105,Michael Smith,41,Engineering,88000,105,Michael Smith,41,Engineering,88000